In [1]:
import pandas as pd
import survey_data as sd
import os

In [2]:
fpath = "data/embed as-built/"
files = [os.path.join(fpath, f) for f in os.listdir(fpath)]
fdata = [sd.read_txt(f) for f in files]
unadjusted_data = pd.concat(fdata)
unadjusted_data.reset_index(drop=True, inplace=True)

In [3]:
data = sd.adjust_elev(unadjusted_data, -21.25)
data["Name"] = data.index
data.describe()

             Name           X           Y           Z
count  853.000000  853.000000  853.000000  853.000000
mean   426.000000  330.723042 -447.526752   15.279151
std    246.384185  196.005812   59.121935   15.970123
min      0.000000  -80.050000 -678.210000  -26.058700
25%    213.000000  138.583100 -483.773300   -0.154800
50%    426.000000  371.456500 -483.412800   15.768600
75%    639.000000  541.524800 -410.089600   33.793800
max    852.000000  601.132800 -195.140000   78.750000

In [4]:
data.Z = data.Z.apply(float)

In [5]:
divs = [-1000, 1, 16.85, 18, 35, 1000]
levels = sd.split_by_level(data, divs)

In [6]:
levels[0].describe()

             Name           X           Y           Z
count  325.000000  325.000000  325.000000  325.000000
mean   536.092308  316.147621 -448.247101   -1.927655
std    229.345144  206.471628   62.053271    5.505555
min      1.000000  -80.050000 -678.210000  -26.058700
25%    259.000000  108.387600 -483.787700   -0.202300
50%    534.000000  368.886400 -483.357400   -0.170100
75%    740.000000  541.343800 -417.092400   -0.147900
max    852.000000  584.365300 -195.140000    0.490600

In [7]:
output_folder = "output/embed data by level/"
if not os.path.exists(output_folder):
    os.mkdir(output_folder)

In [8]:
flr1 = sd.get_feet_inches(levels[0])
ceil1 = sd.get_feet_inches(levels[1])
flr2 = sd.get_feet_inches(levels[2], adjust=-17)
ceil2 = sd.get_feet_inches(levels[3], adjust=-17)
flr3 = sd.get_feet_inches(levels[4], adjust=-35)

In [9]:
flr1.to_csv(output_folder + "level 1 floor.csv", header=False, index=False)
ceil1.to_csv(output_folder + "level 1 ceiling.csv", header=False, index=False)
flr2.to_csv(output_folder + "level 2 floor.csv", header=False, index=False)
ceil2.to_csv(output_folder + "level 2 ceiling.csv", header=False, index=False)
flr3.to_csv(output_folder + "level 3 floor.csv", header=False, index=False)

In [10]:
flr1.head()

,Name,X,Y,Z,Desc,Date,Time,adj_elev,ft_in
1,1,555.9200,-540.7900,-21.2500,NaN,NaN,NaN,-21.2500,"-21' 3-0/8"""
2,2,286.8200,-514.6900,-21.2500,NaN,NaN,NaN,-21.2500,"-21' 3-0/8"""
4,4,412.3755,-565.2389,-0.0871,res,NaN,NaN,-0.0871,"-0' 1-0/8"""
180,180,584.3653,-425.2598,-26.0587,tr,DATE:07-28-2021,TIME:12:30:14,-26.0587,"-26' 0-6/8"""
181,181,555.9404,-546.0015,-20.8703,tr,DATE:07-28-2021,TIME:12:31:24,-20.8703,"-20' 10-4/8"""

In [11]:
data.shape

(853, 7)